---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.GeometryAugmentationService
source: html/79405586-d71a-d842-bc24-2ca45435abe8.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.GeometryAugmentationService Property

## Syntax (C#)
```csharp
public static ExternalServiceId GeometryAugmentationService { get; }
```